{
    "gameTitle": "Boogle Feud",
    "start": "PLAY",
    "profile": "MY PROFILE",
    "settings": "SETTINGS",
    "exit": "EXIT",
    "done": "DONE",
    "back": "BACK",
    "toMenu": "TO_MENU",
    "rematch": "REMATCH",
    "nicknameLabel": "Nickname",
    "nicknameHint": "Enter your nickname",
    "nicknameLimits": "Hint: allowed letters, numbers, and symbol \"-\"",
    "about": "ABOUT",
    "privacy": "PRIVACY POLICY",
    "en": "ENGLISH",
    "ru": "РУССКИЙ",
    "what": "Homeless,Angry,Quiet,Sad,Sleepy,Confused,Strange,Rare,Lucky,Ugly,Careful,Lazy,Boring,Brave,Busy,Antic,Young,Wild,Old,Fuzzy,Loud,Cosmic,Bold,Forest,Broken",
    "who": "Cucumber,Tomato,Boar,Dwarf,Giant,Mole,Raccoon,Hobbit,Banana,Bat,Worm,Snake,Fish,Viper,Rat,Lion,Hawk,Octopus,Frog,Ant,Jaguar,Donut,Mouse,Duck,Elf,Gorilla,Horse,Skull",
    "avatarHint": "Your avatar is generated based on the nickname. For each nickname will be generated his guaranteed by a unique avatar. You can use the auto-generation feature or edit the nickname manually - experiment! This is the place for your creativity!",
    "levelProgressHint" : "Wins for the next level:",
    "level" : "Level",
    "levelShort" : "Lv.",
    "nicknameValidator": "Please enter at least 3 characters",
    "grade_0":"Beginner (level 1-3)",
    "grade_1":"User (level 4-20)",
    "grade_2":"Professional (level 21-40)",
    "grade_3":"Expert (level 41-70)",
    "grade_4":"Elite (level 71-100)",
    "grade_5":"Director of Boogle (level 101+)",
    "gradesHintTitle": "The colour differentiation of levels",
    "entryHint": "Your answer in a word",
    "error": "Oops! Something went wrong. Please, check the Internet connection and try to restart the game",
    "startTurn": "✍️ The turn of",
    "round_0": "Round 1. Simple game",
    "round_1": "Round 2. Double game",
    "round_2": "Round 3. Vice versa game",
    "answerIsCorrect": "This is right answer! 👏",
    "answerIsWrong": "No such answer 🥲",
    "getsBonus": "gets a bonus life! ❤️",
    "winner": "is the winner of this round! 🏅",
    "gotIt": "GOT IT!",
    "descRound_0": "Your task is to guess the six most popular endings of the search question. Answers on the gameboard are arranged in order of decreasing their popularity. The higher the answer is, the more points you can earn. If you guess the right answer, points for them go to the round fund. And your opponent will lose one life point. If you make a mistake, the turn will pass to another player. You can restore one life point if you open the least popular answer, located in the sixth place. Victory and round fund will go to those who will destroy all lifes of the enemy.",
    "descRound_1": "Your task is to guess the six most popular endings of the search question. Answers on the gameboard are arranged in order of decreasing their popularity. The higher the answer is, the more points you can earn. The rules are the same as in the first round but all points scored are doubled (x2).",
    "descRound_2": "You and your opponent in turn call the answer. You have one guess! The first move makes a player who gets the lowest score on the results of previous rounds. In the vice versa game the least popular variant of the answer gains more points. So the task is to guess such an answer who will be present on the list but at the same time will stay as close as possible to the end of the list.",
    "firstMove": "👀 Determine who goes first...",
    "tapToStop": "Tap the dice to stop spinning 🎲",
    "diceNumber": "got the number",
    "diceWins": "🏆 Winner is",
    "diceDraw": "Draw! 😧",
    "openAll": "Opening the remaining answers... 🔓",
    "continueButton": "CONTINUE",
    "win": "Victory!",
    "lose": "Defeat",
    "draw": "Draw",
    "columnName": "Name",
    "columnRound": "Round",
    "columnTotal": "Total",
    "enemySearchStart": "Enemy search...",
    "enemySearchEnd": "Enemy found. Tap to continue",
    "checkAnswers": "Looking for answers in the list 🔍",
    "subtotals": "Subtotals:",
    "guessesLine": "guesses the line #",
    "gameOverTitle": "coming through",
    "gameOverDraw": "The game ended in a draw",
    "gameOverStatus": "🏁 End of the game 🏁",
    "updateDatabase": "We're downloading the strangest search queries on the Web",
    "about_0": "My name is Andrew Sklyarov, I am a developer of the app in front of you. I created this game as a pet project and interactive CV. Next the short story about my work experience and technologies that I have used in the development of the Boogle Feud.",
    "about_1": "I started my career as 1C Enterprise developer. Next, I was doing development in the sphere of app integration and Enterprise Service Buses (ESB). I built high-load processings with 24/7 availability, I have been programming big projects with hundreds of data flows in offline and online retailing. I single-handedly made a mobile application for one of the biggest store of cosmetics and perfumery in Russia. I was a successful independent game developer, my games were downloaded more 27 000 000 times from Google Play, App Store, and Steam.",
    "about_2": "For now, I am looking for jobs as a <mark>Flutter developer</mark>. You can message me via Telegram: <tg>@coder1cv8 (tap to go)</tg>.",
    "about_3": "Now, concerning this game. The game was developed on <mark>Dart</mark> programming language and based on the <mark>Flutter</mark> framework. To structure the code I used Clean Architecture rules. And besides, I follow the design patterns like S.O.L.I.D., D.R.Y., and my favorite K.I.S.S. (keep it simple, you know).",
    "about_4": "App navigation built with <mark>go_router</mark>. UI in English and Russian powered by <mark>easy_localization</mark>. For state management I chose <mark>bloc</mark>. The backend of the app works on <mark>Supabase</mark> with a local cache on <mark>Isar</mark> database. For dependency injection I used <mark>get_it</mark>. However it is the game, we need rich animation to create which I used <mark>flutter_animate</mark>, <mark>lottie</mark>, and a few other libs. For collecting indicators of analytics, errors, and performance app used <mark>Firebase</mark>. The game can be built for any primary platform: Web, Android, iOS, or PC."
}